In [13]:
#판다스는 다차원 데이터 구조에 대해 그리고 그 데이터분석을 파이썬으로 쉽고 빠르게 하기 위해 고안된 패키지.
#Numpy바탕으로 빌드되었고 그래서 Numpy 어플리케이션 쉽게 쓸 수 있음.
#저자가 AQR재직당시부터 빌드 시작.

In [ ]:
# Chapter 5. getting started pandas

# 개념 . series
# 하나의 array와 같은 형태. 

#"index"라는 데이터 라벨의 array와 관계가 있음

#' index - value ' 형태가 기본임

#numpy와 비교를 하자면 인덱스를 선택하거나 재세팅을 통해 "value"를 사용하는 것이 가능함

#numpy에서는 부울 array로 필터링, 스칼라 곱, 수학함수적용 등을 하면서  ' index - value ' 형태로 표현함.

# index 조정도 가능하다.

#python dict의 데이터 포맷도 series 으로 바꿀수 있음 (dict => series 변환)
#=> dict's key를 통해 정렬된 상태의 시리즈로 변환한다는 말


#데이터를 찾을 수 없으면 => nan(not a number)라고 표시됨.

#이런걸 pandas에서 자체적으로 missing value 혹은 na라고 인식하게 되는데 다음과 같은 함수로 인식 뽑아낼 수 있음.

#isnull, notnull, isnull()

#계산할때 계산하면서 자동적으로 align이 되는데 더 자세한 사항은 다른 토픽에서 다룸 chp.7

#시리즈 오브젝트 그리고 그 인덱스는 각각 이름이라는 속성을 가질 수 있음 name.

#시리즈의 인덱스는 값 할당을 함으로써 대체할 수 있음 (인덱스 자체 네임값 바꾸는 거고 인덱스의 딸린 value는 그대로 위치)

In [2]:
from pandas import Series, DataFrame

In [3]:
import pandas as pd

In [4]:
import numpy as np

In [5]:
#Creating a series
obj = Series([4, 7, -5, 3])
obj
#시리즈는 index라 하는 데이터라벨의 array형태 와 관련있다.
#자동적으로 0부터 생성
# index - value

0    4
1    7
2   -5
3    3
dtype: int64

In [6]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [7]:
obj.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [9]:
#인덱스를 직정 할당 해 주는 시리즈 생성
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [10]:
obj2.index #인덱스 속성

Index([u'd', u'b', u'a', u'c'], dtype='object')

In [11]:
obj2['a']

-5

In [13]:
obj2['d'] = 6
obj2[['c', 'a', 'd']] # 인덱스를 이용 값을 불러냄. 인덱스 불러낸 순서대로 값도 나옴

c    3
a   -5
d    6
dtype: int64

In [14]:
obj2 #원래 순서는 변하지 않음

d    6
b    7
a   -5
c    3
dtype: int64

In [15]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [16]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [17]:
np.exp(obj2) #numpy에서 수학 함수적용

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [18]:
'b' in obj2

True

In [19]:
sdata = {'Ohio' : 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [20]:
sdata #딕을 시리즈로 변환

{'Ohio': 35000, 'Oregon': 16000, 'Texas': 71000, 'Utah': 5000}

In [21]:
obj3 = Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [22]:
states=['California', 'Ohio', 'Oregon', 'Texas']
obj4 = Series(sdata, index=states)

In [23]:
obj4 #근데, 여기서 적절한 데이터를 가지고있던 것과 다르게 california는 데이터를 찾을 수 없어 nan(not a number)라고 표시됨.

California      NaN
Ohio          35000
Oregon        16000
Texas         71000
dtype: float64

In [24]:
pd.isnull(obj4) #이런걸 pandas에서 자체적으로 missing value 혹은 na라고 인식하게 되는데 다음과 같은 함수로 인식 뽑아낼 수 있음.

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [25]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [26]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [27]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [28]:
obj4

California      NaN
Ohio          35000
Oregon        16000
Texas         71000
dtype: float64

In [29]:
obj3 + obj4 #nan 한쪽에 값이없음.

California       NaN
Ohio           70000
Oregon         32000
Texas         142000
Utah             NaN
dtype: float64

In [26]:
obj4.name = 'population' #시리즈 오브젝트 그리고 그 인덱스는 각각 이름이라는 속성을 가질 수 있음

In [27]:
obj4.index.name = 'state'

In [28]:
obj4

state
California      NaN
Ohio          35000
Oregon        16000
Texas         71000
Name: population, dtype: float64

In [29]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan'] #시리즈의 인덱스는 값 할당을 함으로써 대체할 수 있음. 값은 그대로 이름 바꾸기

In [30]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [ ]:
#개념 . data frame 

#테이블과 같은 형태를 말하고, 쉽게 말하면 데이터시트 모양.

# "각각 다른데이터 타입들인 컬럼들의 모음", 숫자, 문자, 논리, 등

#시리즈의 dict을 통해 로우, 컬럼 인덱스를 가짐. 인덱스는 row, column 각각 하나를 공유함

#- data 프레임 생성하는 법
#같은 길이를 가진 리스트를 모아논 딕을 이용하거나 아님 numpy arrays를 이용함

#***[딕셔너리특징]: 키를 이용해 값을 추출, 임의 순서.****
#=> 파이썬 내장자료형. 사전형으로 나중에 바꿀수 있는 "뮤터블(mutable) 방식"의 연관 배열의 키와 값 쌍.

#data frame 생성하게 되면 옆에 인덱스도 같이 생겨남. 

#컬럼 순서도 조절가능. 데이터 프레임 컬럼 안에서 검색하는 방식임. 로우로도 검색이 가능함->인덱스를 이용

#할당을 함으로써 데이터 프레임 내용을 바꾸기도함.

#이름속성가지고 있음 -> 이름도 화면에 뿌려줌.

In [33]:
#There are numerous ways to construct a DataFrame, though one of the most common
#is from a dict of equal-length lists or NumPy arrays
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)

In [34]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [35]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [36]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],index=['one', 'two', 'three', 'four', 'five'])

In [37]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [38]:
frame2.columns

Index([u'year', u'state', u'pop', u'debt'], dtype='object')

In [39]:
frame2['state'] #state컬럼 가져옴 인덱스도 함께

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [40]:
frame2.year #year컬럼 가져옴 인덱스도

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [41]:
frame2.ix['three'] # 행을 가져올때는 .ix라는 표현으로 가져옴

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [42]:
frame2['debt'] = 16.5 # 값은 변하는 뮤터블 방식으로 쉽게 바꿈 16.5로 전부 할당.

In [43]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [44]:
frame2['debt'] = np.arange(5.) #np 이용

In [45]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4

In [46]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [47]:
frame2['debt'] = val

In [48]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [49]:
frame2['eastern'] = frame2.state == 'Ohio' #참/짓 값으로 열추가

In [50]:
frame2

       year   state  pop  debt eastern
one    2000    Ohio  1.5   NaN    True
two    2001    Ohio  1.7  -1.2    True
three  2002    Ohio  3.6   NaN    True
four   2001  Nevada  2.4  -1.5   False
five   2002  Nevada  2.9  -1.7   False

In [51]:
del frame2['eastern']

In [52]:
frame2.columns

Index([u'year', u'state', u'pop', u'debt'], dtype='object')

In [53]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [55]:
frame3 = DataFrame(pop)

In [57]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [60]:
frame3.T #transpose

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [61]:
DataFrame(pop, index=[2001, 2002, 2003]) #2001,2002는 그대로 2003은 값이 없어서 nan

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [59]:
pdata = {'Ohio': frame3['Ohio'][:-1],'Nevada': frame3['Nevada'][:2]}

In [62]:
#slicing
#s = 'abcdef'
#l = [100, 200, 300]
#s[1:3] # 1번 위치와 3번 위치 사이를 나타냄
#s[1:] # 1부터 끝까지
#s[:] # 처음부터 끝까지
#s[-100:100] # 범위를 넘어서면 범위 내의 값으로 자동 처리
#l[:-1] # 맨 끝 값을 제외하고 모두
#s[::2] # 2칸 단위로
#s[::-1] # 거꾸로

'bc'

In [60]:
pdata

{'Nevada': 2000    NaN
 2001    2.4
 Name: Nevada, dtype: float64, 'Ohio': 2000    1.5
 2001    1.7
 Name: Ohio, dtype: float64}

In [63]:
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [64]:
frame3.index.name = 'year'; frame3.columns.name = 'state'

In [65]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [66]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [67]:
frame2.values

array([[2000L, 'Ohio', 1.5, nan],
       [2001L, 'Ohio', 1.7, -1.2],
       [2002L, 'Ohio', 3.6, nan],
       [2001L, 'Nevada', 2.4, -1.5],
       [2002L, 'Nevada', 2.9, -1.7]], dtype=object)

In [20]:
#Index Objects
#판다스의 인덱스는 축으로 잡고 있을려고 쓰이나..
#아님 다른 어레이나 순차적인 라벨을 시리즈나 데이터 프레임으로 만들때 내부적으로 인덱스로 변환함..
#인덱스 오브젝트는 변경할수 없음 => 데이터구조를 안전하게 공유시켜주는 중요한 속성

obj = Series(range(3), index=['a', 'b', 'c'])

In [6]:
obj

a    0
b    1
c    2
dtype: int64

In [7]:
index = obj.index

In [8]:
index

Index([u'a', u'b', u'c'], dtype='object')

In [15]:
index[1:]

Index([u'b', u'c'], dtype='object')

In [64]:
index = pd.Index(np.arange(3))?????

In [65]:
obj2 = Series([1.5, -2.5, 0], index=index)

In [66]:
index

Int64Index([0, 1, 2], dtype='int64')

In [67]:
obj2.index is index

True

In [68]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [80]:
'Ohio' in frame3.columns

True

In [81]:
2003 in frame3.index

False

In [ ]:
#차례. essential functionality


#1. reindexing
#판다스 오브젝트에서 중요한 기능.
#2. dropping entries from an axis
#3. indexing, selection and filtering
#4. arithmetic and data alignment
#- arithmetic methods with fill values
#- operations between dataframe and series

In [ ]:
#Reindexing

In [82]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [83]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [84]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [85]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [86]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0) #0으로 채움

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [87]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [88]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [22]:
frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],columns=['Ohio', 'Texas', 'California'])

In [26]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [27]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [28]:
frame2

   Ohio  Texas  California
a     0      1           2
b   NaN    NaN         NaN
c     3      4           5
d     6      7           8

In [29]:
states = ['Texas', 'Utah', 'California']

In [30]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [95]:
frame.reindex(index=['a', 'b', 'c', 'd'], method='ffill',columns=states)

   Texas  Utah  California
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [31]:
frame.ix[['a', 'b', 'c', 'd'], states]

   Texas  Utah  California
a      1   NaN           2
b    NaN   NaN         NaN
c      4   NaN           5
d      7   NaN           8

In [70]:
#Dropping entries from an axis
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

In [71]:
new_obj = obj.drop('c')

In [72]:
new_obj

a    0
b    1
d    3
e    4
dtype: float64

In [73]:
obj.drop(['d', 'c'])

a    0
b    1
e    4
dtype: float64

In [74]:
data = DataFrame(np.arange(16).reshape((4, 4)),index=['Ohio', 'Colorado', 'Utah', 'New York'],columns=['one', 'two', 'three', 'four'])

In [75]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [77]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [104]:
data.drop(['two', 'four'], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [39]:
#Indexing, selection, and filtering
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [40]:
obj

a    0
b    1
c    2
d    3
dtype: float64

In [78]:
obj['b']

1.0

In [79]:
obj[1]

1.0

In [80]:
obj[2:4]

c    2
d    3
dtype: float64

In [81]:
obj[['b', 'a', 'd']]

b    1
a    0
d    3
dtype: float64

In [82]:
obj[[1, 3]]

b    1
d    3
dtype: float64

In [83]:
obj[obj < 2]

a    0
b    1
dtype: float64

In [84]:
obj['b':'c']

b    1
c    2
dtype: float64

In [113]:
obj['b':'c'] = 5

In [85]:
data = DataFrame(np.arange(16).reshape((4, 4)),index=['Ohio', 'Colorado', 'Utah', 'New York'],columns=['one', 'two', 'three', 'four'])

In [86]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [87]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [88]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [89]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [90]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [91]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [121]:
data[data < 5] = 0

In [95]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [92]:
data.ix['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [94]:
data.ix[['Colorado', 'Utah'], [3, 0, 1]]

          four  one  two
Colorado     7    4    5
Utah        11    8    9

In [96]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [126]:
data.ix[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [127]:
data.ix[data.three > 5, :3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [97]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])

In [98]:
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [99]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [100]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [101]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [102]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),index=['Ohio', 'Texas', 'Colorado'])

In [103]:
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [104]:
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [105]:
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [106]:
df1 + df2

           b   c   d   e
Colorado NaN NaN NaN NaN
Ohio       3 NaN   6 NaN
Oregon   NaN NaN NaN NaN
Texas      9 NaN  12 NaN
Utah     NaN NaN NaN NaN

In [107]:
#Arithmetic methods with fill values
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))

In [108]:
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))

In [109]:
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [110]:
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [111]:
df1 + df2

    a   b   c   d   e
0   0   2   4   6 NaN
1   9  11  13  15 NaN
2  18  20  22  24 NaN
3 NaN NaN NaN NaN NaN

In [112]:
df1.add(df2, fill_value=0) #df2를 추가

    a   b   c   d   e
0   0   2   4   6   4
1   9  11  13  15   9
2  18  20  22  24  14
3  15  16  17  18  19

In [113]:
df1.reindex(columns=df2.columns, fill_value=0)

   a  b   c   d  e
0  0  1   2   3  0
1  4  5   6   7  0
2  8  9  10  11  0

In [145]:
#Operations between DataFrame and Series
arr = np.arange(12.).reshape((3, 4))

In [146]:
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [147]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [148]:
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [149]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [150]:
series = frame.ix[0]

In [151]:
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [152]:
series

b    0
d    1
e    2
Name: Utah, dtype: float64

In [153]:
frame - series

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Texas   6  6  6
Oregon  9  9  9

In [154]:
series2 = Series(range(3), index=['b', 'e', 'f'])

In [155]:
frame + series2

        b   d   e   f
Utah    0 NaN   3 NaN
Ohio    3 NaN   6 NaN
Texas   6 NaN   9 NaN
Oregon  9 NaN  12 NaN

In [156]:
series3 = frame['d']

In [157]:
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [158]:
series3

Utah       1
Ohio       4
Texas      7
Oregon    10
Name: d, dtype: float64

In [159]:
frame.sub(series3, axis=0)

        b  d  e
Utah   -1  0  1
Ohio   -1  0  1
Texas  -1  0  1
Oregon -1  0  1

In [ ]:
#############그외 기능들###########
#################################
#1. function application and mapping
#2. sorting and ranking 
#3. axis indexes with duplicate values
#4. summarizing and computing dscriptive statistics
#5. correlation and covariance
#6. unique values, value counts, and membership
#7. handling missing data
#8. filtering out missing data
#9. filtering in missing data
#10. hierarchical indexing 
#11. reordering and sorting levels
#12. summary statistics by level
#13. using a data frame's columns

In [160]:
#Function application and mapping
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'),index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [161]:
frame

               b         d         e
Utah   -0.228358 -1.728804  0.848463
Ohio   -0.260151 -0.593024  1.137165
Texas   1.055624 -2.631807 -2.982984
Oregon -0.394640  0.019647  1.148857

In [162]:
np.abs(frame)

               b         d         e
Utah    0.228358  1.728804  0.848463
Ohio    0.260151  0.593024  1.137165
Texas   1.055624  2.631807  2.982984
Oregon  0.394640  0.019647  1.148857

In [163]:
f = lambda x: x.max() - x.min()

In [164]:
frame.apply(f)

b    1.450263
d    2.651454
e    4.131841
dtype: float64

In [165]:
frame.apply(f, axis=1)

Utah      2.577267
Ohio      1.730189
Texas     4.038608
Oregon    1.543496
dtype: float64

In [166]:
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])

In [167]:
frame.apply(f)

            b         d         e
min -0.394640 -2.631807 -2.982984
max  1.055624  0.019647  1.148857

In [168]:
format = lambda x: '%.2f' % x

In [169]:
frame.applymap(format)

            b      d      e
Utah    -0.23  -1.73   0.85
Ohio    -0.26  -0.59   1.14
Texas    1.06  -2.63  -2.98
Oregon  -0.39   0.02   1.15

In [170]:
frame['e'].map(format)

Utah       0.85
Ohio       1.14
Texas     -2.98
Oregon     1.15
Name: e, dtype: object

In [171]:
#Sorting and ranking
obj = Series(range(4), index=['d', 'a', 'b', 'c'])

In [172]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [173]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
                  columns=['d', 'a', 'b', 'c'])

In [174]:
columns=['d', 'a', 'b', 'c'])

SyntaxError: invalid syntax (<ipython-input-174-53b55f5e92dc>, line 1)

In [175]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [176]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [177]:
obj = Series([4, 7, -3, 2])

In [178]:
obj.order()

2   -3
3    2
0    4
1    7
dtype: int64

In [179]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])

In [180]:
obj.order()

4    -3
5     2
0     4
2     7
1   NaN
3   NaN
dtype: float64

In [181]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [182]:
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [183]:
frame.sort_index(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [184]:
frame.sort_index(by=['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [185]:
obj = Series([7, -5, 7, 4, 2, 0, 4])

In [186]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [187]:
obj.rank(method='first')

0    6
1    1
2    7
3    4
4    3
5    2
6    5
dtype: float64

In [188]:
obj.rank(ascending=False, method='max')

0    2
1    7
2    2
3    4
4    5
5    6
6    4
dtype: float64

In [189]:
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                   'c': [-2, 5, 8, -2.5]})

In [190]:
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [191]:
frame.rank(axis=1)

   a  b  c
0  2  3  1
1  1  3  2
2  2  1  3
3  2  3  1

In [192]:
#Axis indexes with duplicate values
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [193]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [194]:
obj.index.is_unique

False

In [195]:
False

False

In [196]:
obj['a']

a    0
a    1
dtype: int64

In [197]:
obj['c']

4

In [198]:
df = DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])

In [199]:
df

          0         1         2
a -0.440239  0.598897  1.149773
a  1.184014 -0.416417  0.217372
b -0.012107  1.160318 -0.784362
b  1.019124  1.117186 -0.340408

In [200]:
df.ix['b']

          0         1         2
b -0.012107  1.160318 -0.784362
b  1.019124  1.117186 -0.340408

In [201]:
#Summarizing and Computing Descriptive Statistics
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
                [np.nan, np.nan], [0.75, -1.3]],
               index=['a', 'b', 'c', 'd'],
               columns=['one', 'two'])

In [202]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [203]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [204]:
df.sum(axis=1)

a    1.40
b    2.60
c     NaN
d   -0.55
dtype: float64

In [205]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [206]:
df.idxmax()

one    b
two    d
dtype: object

In [207]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [208]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [209]:
obj = Series(['a', 'a', 'b', 'c'] * 4)

In [210]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [211]:
#Correlation and Covariance

In [282]:
#Covariance
s1 = pd.Series(np.random.randn(1000))
s1

0     0.247454
1     0.058876
2     0.602775
3    -0.044405
4     0.306930
5     0.228767
6    -0.676138
7    -0.008622
8    -0.870544
9     1.311891
10    1.335429
11   -0.883696
12   -1.712982
13   -0.435102
14   -0.075757
...
985    1.426596
986    0.751048
987    2.208571
988   -0.885805
989    0.197622
990    1.974677
991   -1.067392
992   -0.924495
993    1.081801
994    0.117709
995   -0.228392
996    0.708925
997    0.146791
998   -0.126992
999   -0.503970
Length: 1000, dtype: float64

In [283]:
s2 = pd.Series(np.random.randn(1000))

In [284]:
s1.cov(s2)

-0.033533309883040589

In [285]:
frame = pd.DataFrame(np.random.randn(1000, 5), columns=['a', 'b', 'c', 'd', 'e'])

In [287]:
frame

            a         b         c         d         e
0    0.304603 -1.003883 -0.623616 -1.276967  0.871491
1    1.232074 -0.826946  1.806012  0.884280  0.105423
2    0.893159 -1.774666 -1.269879 -0.266274 -1.167038
3   -0.022245  1.133163  0.410872  0.775529  0.637563
4   -0.284831  0.710162  1.147768  0.888150 -0.446418
5   -0.180561  0.057488 -1.296886  0.498080 -2.016411
6    2.032941  1.887640  0.409630 -1.091834  0.511996
7    0.014170  0.333400  0.327003  0.901422 -1.869177
8    0.257710  0.098468  0.117191  1.870145 -1.140480
9    1.285663 -0.570287 -0.973370 -0.816460 -0.801401
10  -1.036814 -0.806093 -0.701696  1.314174  0.484627
11  -0.633504  1.138139  0.345936  0.743116 -0.914009
12   1.015859  2.893161 -0.145261  1.378694  1.042337
13  -0.857475  0.807379  0.567633 -0.000618  0.747190
14  -1.214585 -0.098765 -0.022889  0.760124  1.205246
15  -1.510423  0.748930  0.468043 -1.527091  0.628777
16   0.567186  1.609211 -0.909799  1.816020 -0.751739
17   1.217668  0.070881  0.400133  0.814895  0.457092
18   2.483536 -0.349447  0.350627  0.670005  0.330236
19   0.207165  1.376589 -1.158118  0.804436  1.014091
20   0.278738 -0.045250  0.819851 -1.770786  0.273878
21   0.858420  0.535773 -1.062372  0.628641 -0.267644
22  -0.628935 -0.847696  0.614280 -1.462133  1.123019
23  -0.641929  2.449222  2.133260 -0.014434 -0.719851
24  -1.561042  1.318656 -0.609733 -0.298542  0.274667
25   0.954290  0.143273 -1.642941  0.836011 -0.908236
26  -0.868671 -0.518220 -1.188309 -0.398437 -1.295570
27   1.085208  0.693953  1.318122  2.200519  1.489295
28   1.218411 -0.396123  0.126663 -0.027821 -0.743752
29   0.314008  0.755768  0.394426  0.137050 -0.169609
..        ...       ...       ...       ...       ...
970 -0.733409  2.917732  0.657871 -1.477777 -0.959269
971 -0.681239  0.823344 -0.326864  1.579560  0.516301
972  0.525328 -0.198495 -0.132502  1.140753  0.906825
973  0.282605  0.157845 -0.955804 -0.041588  0.651295
974  1.190634  0.658771 -0.000405 -1.872889 -0.172813
975  0.553574  1.340309  0.299995 -1.351738  0.309689
976 -0.041434  0.320320 -0.042668 -0.490335  0.698740
977 -1.714840  1.896539  0.447241 -0.949559 -1.496572
978 -0.636516  0.251443  0.913559 -0.670720 -3.180854
979  0.578461 -0.403495  2.907382  0.496539  0.518056
980 -1.882711  0.031783 -0.962025  1.456677 -0.651827
981  1.919609  0.515750 -0.484912 -0.206161  0.738202
982  0.124636  0.040437  1.994616  0.028577  0.623353
983  0.679801 -0.043912 -2.133265 -0.653222  0.843013
984 -0.458495  1.490028  0.492435 -1.351638 -0.761822
985 -0.525567 -0.071680 -0.716205 -0.624318  0.725858
986 -1.442671  0.046702  0.078176 -0.331882 -1.218140
987 -0.920765  0.963573 -0.469272 -0.388402 -0.343361
988 -1.037468 -0.121336 -0.267469  1.340097  0.641961
989  0.400146 -0.909233  0.587211 -1.007013 -1.383415
990 -0.963058  1.440381 -0.630313 -0.095530  0.027020
991 -0.994648 -0.294711 -0.758446 -0.082321 -0.660634
992 -0.162206 -0.646552  0.036953 -0.089328  1.669839
993 -2.527465  1.629041  0.017385 -1.313107  0.688098
994 -1.622544 -1.396590 -0.541336  0.342676  0.241744
995  1.493439  0.905920  0.338328  1.260220 -1.678997
996  0.552385  0.489213  0.063675  1.115531  0.451868
997  0.568619  1.786553  0.128131  1.662683 -0.303290
998  1.612181 -0.127013 -1.695149  0.458481  0.141171
999  0.749868  0.615202  0.395243 -1.082436  0.149805

[1000 rows x 5 columns]

In [286]:
frame.cov()

          a         b         c         d         e
a  0.968154 -0.006080  0.022133  0.047813 -0.009397
b -0.006080  0.956637  0.001880  0.072408  0.021409
c  0.022133  0.001880  1.055216  0.052966  0.038486
d  0.047813  0.072408  0.052966  1.119869  0.052199
e -0.009397  0.021409  0.038486  0.052199  0.987938

In [288]:
frame = pd.DataFrame(np.random.randn(20, 3), columns=['a', 'b', 'c'])

In [290]:
frame.ix[:5, 'a'] = np.nan

In [291]:
frame.ix[5:10, 'b'] = np.nan

In [292]:
frame.cov()

          a         b         c
a  0.596700 -0.194106 -0.234215
b -0.194106  0.851051  0.263983
c -0.234215  0.263983  0.837600

In [293]:
frame.cov(min_periods=12)

          a         b         c
a  0.596700       NaN -0.234215
b       NaN  0.851051  0.263983
c -0.234215  0.263983  0.837600

In [114]:
#Correlation
frame = pd.DataFrame(np.random.randn(1000, 5), columns=['a', 'b', 'c', 'd', 'e'])

In [295]:
frame.ix[::2] = np.nan

In [296]:
frame['a'].corr(frame['b'])

0.079844556740970532

In [297]:
frame['a'].corr(frame['b'], method='spearman')

0.075074220296881197

In [298]:
frame.corr()

          a         b         c         d         e
a  1.000000  0.079845 -0.005305  0.014766  0.025553
b  0.079845  1.000000  0.027392  0.019603  0.020377
c -0.005305  0.027392  1.000000  0.009094 -0.066127
d  0.014766  0.019603  0.009094  1.000000 -0.053345
e  0.025553  0.020377 -0.066127 -0.053345  1.000000

In [299]:
frame = pd.DataFrame(np.random.randn(20, 3), columns=['a', 'b', 'c'])

In [300]:
frame.ix[:5, 'a'] = np.nan

In [302]:
frame.ix[5:10, 'b'] = np.nan

In [304]:
frame.corr()

          a         b         c
a  1.000000  0.166456 -0.183511
b  0.166456  1.000000 -0.378132
c -0.183511 -0.378132  1.000000

In [305]:
frame.corr(min_periods=12)

          a         b         c
a  1.000000       NaN -0.183511
b       NaN  1.000000 -0.378132
c -0.183511 -0.378132  1.000000

In [306]:
index = ['a', 'b', 'c', 'd', 'e']

In [307]:
columns = ['one', 'two', 'three', 'four']

In [309]:
df1 = pd.DataFrame(np.random.randn(5, 4), index=index, columns=columns)

In [310]:
df2 = pd.DataFrame(np.random.randn(4, 4), index=index[:4], columns=columns)

In [311]:
df1.corrwith(df2)

one      0.191311
two      0.111493
three   -0.630312
four     0.803683
dtype: float64

In [312]:
df2.corrwith(df1, axis=1)

a    0.193208
b    0.642309
c   -0.597993
d   -0.023159
e         NaN
dtype: float64

In [313]:
#Unique Values, Value Counts, and Membership
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [314]:
uniques = obj.unique()

In [315]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [316]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [317]:
pd.value_counts(obj.values, sort=False)

a    3
c    3
b    2
d    1
dtype: int64

In [318]:
mask = obj.isin(['b', 'c'])

In [319]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [320]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [321]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4],'Qu2': [2, 3, 1, 2, 3],'Qu3': [1, 5, 2, 4, 4]})

In [322]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [323]:
result = data.apply(pd.value_counts).fillna(0)

In [324]:
result

   Qu1  Qu2  Qu3
1    1    1    1
2    0    2    1
3    2    2    0
4    2    0    2
5    0    0    1

In [325]:
#Handling Missing Data
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [326]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [327]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [328]:
string_data[0] = None

In [329]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [330]:
#Filtering Out Missing Data
from numpy import nan as NA

In [331]:
data = Series([1, NA, 3.5, NA, 7])

In [332]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [333]:
data.dropna(how='all')

0    1.0
2    3.5
4    7.0
dtype: float64

In [334]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [335]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])

In [336]:
cleaned = data.dropna()

In [337]:
data

    0    1   2
0   1  6.5   3
1   1  NaN NaN
2 NaN  NaN NaN
3 NaN  6.5   3

In [338]:
cleaned

   0    1  2
0  1  6.5  3

In [339]:
data.dropna(how='all')

    0    1   2
0   1  6.5   3
1   1  NaN NaN
3 NaN  6.5   3

In [340]:
data[4] = NA

In [341]:
data

    0    1   2   4
0   1  6.5   3 NaN
1   1  NaN NaN NaN
2 NaN  NaN NaN NaN
3 NaN  6.5   3 NaN

In [342]:
data.dropna(axis=1, how='all')

    0    1   2
0   1  6.5   3
1   1  NaN NaN
2 NaN  NaN NaN
3 NaN  6.5   3

In [343]:
df = DataFrame(np.random.randn(7, 3))

In [344]:
df.ix[:4, 1] = NA; df.ix[:2, 2] = NA

In [345]:
df

          0         1         2
0 -0.383081       NaN       NaN
1 -1.756590       NaN       NaN
2  0.180579       NaN       NaN
3  0.139160       NaN  0.809379
4 -0.233759       NaN -1.815803
5 -0.317686  0.186285  0.467935
6  1.064022  2.312071  0.263683

In [346]:
df.dropna(thresh=3)

          0         1         2
5 -0.317686  0.186285  0.467935
6  1.064022  2.312071  0.263683

In [347]:
#Filling in Missing Data
df.fillna(0)

          0         1         2
0 -0.383081  0.000000  0.000000
1 -1.756590  0.000000  0.000000
2  0.180579  0.000000  0.000000
3  0.139160  0.000000  0.809379
4 -0.233759  0.000000 -1.815803
5 -0.317686  0.186285  0.467935
6  1.064022  2.312071  0.263683

In [348]:
df.fillna({1: 0.5, 3: -1})

          0         1         2
0 -0.383081  0.500000       NaN
1 -1.756590  0.500000       NaN
2  0.180579  0.500000       NaN
3  0.139160  0.500000  0.809379
4 -0.233759  0.500000 -1.815803
5 -0.317686  0.186285  0.467935
6  1.064022  2.312071  0.263683

In [349]:
# always returns a reference to the filled object

In [350]:
_ = df.fillna(0, inplace=True)

In [351]:
df

          0         1         2
0 -0.383081  0.000000  0.000000
1 -1.756590  0.000000  0.000000
2  0.180579  0.000000  0.000000
3  0.139160  0.000000  0.809379
4 -0.233759  0.000000 -1.815803
5 -0.317686  0.186285  0.467935
6  1.064022  2.312071  0.263683

In [352]:
df = DataFrame(np.random.randn(6, 3))

In [353]:
df.ix[2:, 1] = NA; df.ix[4:, 2] = NA

In [354]:
df

          0         1         2
0 -0.547476 -1.127442  0.712644
1 -0.792080  0.507093 -1.904775
2 -0.307156       NaN -0.104606
3 -0.976061       NaN  0.389270
4  1.462086       NaN       NaN
5  0.945056       NaN       NaN

In [355]:
df.fillna(method='ffill')

          0         1         2
0 -0.547476 -1.127442  0.712644
1 -0.792080  0.507093 -1.904775
2 -0.307156  0.507093 -0.104606
3 -0.976061  0.507093  0.389270
4  1.462086  0.507093  0.389270
5  0.945056  0.507093  0.389270

In [356]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.547476 -1.127442  0.712644
1 -0.792080  0.507093 -1.904775
2 -0.307156  0.507093 -0.104606
3 -0.976061  0.507093  0.389270
4  1.462086       NaN  0.389270
5  0.945056       NaN  0.389270

In [357]:
data = Series([1., NA, 3.5, NA, 7])

In [358]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [359]:
#Hierarchical Indexing
data = Series(np.random.randn(10),
              index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                     [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])

In [360]:
data

a  1    0.540422
   2    1.371907
   3   -0.414542
b  1   -0.549420
   2    0.147723
   3   -0.415729
c  1   -1.601919
   2    0.262248
d  2   -0.077885
   3   -1.228428
dtype: float64

In [361]:
data.index

MultiIndex(levels=[[u'a', u'b', u'c', u'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [362]:
data['b']

1   -0.549420
2    0.147723
3   -0.415729
dtype: float64

In [363]:
data['b':'c']

b  1   -0.549420
   2    0.147723
   3   -0.415729
c  1   -1.601919
   2    0.262248
dtype: float64

In [364]:
data.ix[['b', 'd']]

b  1   -0.549420
   2    0.147723
   3   -0.415729
d  2   -0.077885
   3   -1.228428
dtype: float64

In [365]:
data[:, 2]

a    1.371907
b    0.147723
c    0.262248
d   -0.077885
dtype: float64

In [366]:
data.unstack()

          1         2         3
a  0.540422  1.371907 -0.414542
b -0.549420  0.147723 -0.415729
c -1.601919  0.262248       NaN
d       NaN -0.077885 -1.228428

In [367]:
data.unstack().stack()

a  1    0.540422
   2    1.371907
   3   -0.414542
b  1   -0.549420
   2    0.147723
   3   -0.415729
c  1   -1.601919
   2    0.262248
d  2   -0.077885
   3   -1.228428
dtype: float64

In [368]:
frame = DataFrame(np.arange(12).reshape((4, 3)),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=[['Ohio', 'Ohio', 'Colorado'],
                           ['Green', 'Red', 'Green']])

In [369]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [370]:
frame.index.names = ['key1', 'key2']

In [371]:
frame.columns.names = ['state', 'color']

In [372]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [373]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [377]:
MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']],names=['state', 'color'])

NameError: name 'MultiIndex' is not defined

In [378]:
#Reordering and Sorting Levels
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [379]:
frame.sortlevel(1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [380]:
frame.swaplevel(0, 1).sortlevel(0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [381]:
#Summary Statistics by Level
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [382]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [384]:
#Using a DataFrame’s Columns
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1),
                   'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                   'd': [0, 1, 2, 0, 1, 2, 3]})

In [385]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [386]:
frame2 = frame.set_index(['c', 'd'])

In [387]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [388]:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [389]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [392]:
#Other pandas Topics
#Integer Indexing
ser = Series(np.arange(3.))

In [394]:
ser[-1]

0    0
1    1
2    2
dtype: float64

In [395]:
ser

0    0
1    1
2    2
dtype: float64

In [396]:
ser2 = Series(np.arange(3.), index=['a', 'b', 'c'])

In [397]:
ser2[-1]

2.0

In [398]:
ser.ix[:1]

0    0
1    1
dtype: float64

In [399]:
ser3 = Series(range(3), index=[-5, 1, 3])

In [400]:
ser3.iget_value(2)

2

In [405]:
frame = DataFrame(np.arange(6).reshape(3, 2), index=[2, 0, 1])

In [406]:
frame.irow(0)

0    0
1    1
Name: 2, dtype: int32

In [407]:
#Panel Data
import pandas.io.data as web
pdata = pd.Panel(dict((stk, web.get_data_yahoo(stk, '1/1/2009', '6/1/2012'))
for stk in ['AAPL', 'GOOG', 'MSFT', 'DELL']))

IOError: after 3 tries, Yahoo! did not return a 200 for url 'http://ichart.finance.yahoo.com/table.csv?s=GOOG&a=0&b=1&c=2009&d=5&e=1&f=2012&g=d&ignore=.csv'

In [408]:
import pandas.io.data as web
pdata = pd.Panel(dict((stk, web.get_data_yahoo(stk, '1/1/2009', '6/1/2012'))
                      for stk in ['AAPL', 'GOOG', 'MSFT', 'DELL']))

IOError: after 3 tries, Yahoo! did not return a 200 for url 'http://ichart.finance.yahoo.com/table.csv?s=GOOG&a=0&b=1&c=2009&d=5&e=1&f=2012&g=d&ignore=.csv'

In [410]:
STOCK_CODE = "KRX:KOSPI200"
DATA_SOURCE = 'google'
START_DATE = "2008/01/01"
END_DATE = "2015/02/11"
 
mystock = web.DataReader(STOCK_CODE, data_source=DATA_SOURCE, start=START_DATE, end=END_DATE)
mystock.head()

UnicodeDecodeError: 'ascii' codec can't decode byte 0xef in position 55: ordinal not in range(128)

In [1]:
from pandas.io import data, wb

In [2]:
STOCK_CODE = "KRX:KOSPI200"

In [3]:
DATA_SOURCE = 'google'

In [4]:
START_DATE = '2008/01/01'

In [5]:
END_DATE = "2015/02/11"

In [6]:
mystock = web.DataReader(STOCK_CODE, data_source=DATA_SOURCE, start=START_DATE, end=END_DATE)

NameError: name 'web' is not defined

In [7]:
mystock

NameError: name 'mystock' is not defined

In [420]:
pdata = pd.Panel(dict((stk, web.get_data_yahoo(stk, '1/1/2009', '6/1/2012'))
for stk in ['AAPL', 'GOOG', 'MSFT', 'DELL']))

IOError: after 3 tries, Yahoo! did not return a 200 for url 'http://ichart.finance.yahoo.com/table.csv?s=GOOG&a=0&b=1&c=2009&d=5&e=1&f=2012&g=d&ignore=.csv'

In [8]:
all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    try:
        all_data[ticker] = web.get_data_yahoo(ticker, '1/1/2003', '1/1/2013')
        price = DataFrame({tic: data['Adj Close']
                    for tic, data in all_data.iteritems()})
        volume = DataFrame({tic: data['Volume']
                    for tic, data in all_data.iteritems()})
    except:
        print "Cant find ", ticker

Cant find  AAPL
Cant find  IBM
Cant find  MSFT
Cant find  GOOG

In [9]:
import pandas.io.data as web

jpy = web.DataReader('DEXJPUS', 'fred')

In [13]:
import pandas.io.data as web
import datetime
start = datetime.datetime(2015, 2, 2)
end = datetime.datetime(2015, 2, 13)
gs = web.DataReader("078930.KS", "yahoo", start, end)

In [14]:
gs

             Open   High    Low  Close  Volume  Adj Close
Date
2015-02-02  42600  43200  41850  42250  522700      42250
2015-02-03  42900  43100  42100  42400  262600      42400
2015-02-04  43500  43500  42500  42500  302300      42500
2015-02-05  42100  42500  41800  42200  184900      42200
2015-02-06  42300  42400  41650  42350  296700      42350
2015-02-09  42100  43000  42050  42250  155000      42250
2015-02-10  42100  42950  42000  42250  143400      42250
2015-02-11  42250  42750  41400  42300  252600      42300
2015-02-12  41950  42200  41450  42100  281700      42100
2015-02-13  42350  43150  42200  42300  310000      42300